# Variables, Types, Operators

---

## Basics of programming for Data Science and Machine Learning


Applied Mathematical Modeling in Banking

---

## Table of contents

1. Vectors
2. Matrices
3. Factors
4. Data frames
5. Lists
6. Apply functions family

---

# 1. Vectors

### Announcement of vectors

A vector is a base data type in `R` that allows you to write a collection of elements of the same type with or without `c() `if it is a sequence of values.

_Note. In essence, the function `c )` allows you to combine several vectors._

Consider for example the usual variable `x`:

In [2]:
x <- 10

In essence, `x` in this case is a vector consisting of one value of` 10`. We can also write several elements to the variable `x`:

In [3]:
x <- c(1, 2, 2.5, 3)
x

[1] 1.0 2.0 2.5 3.0

Vector elements can be values of any type: `numeric`,` character`, `logical`, etc .:

In [4]:
v1 <- c(1, 3, 4, 6, 7)
v2 <- c(T, F, F, T, F)
v3 <- c("Hello", "my", "friend", "!")

Vector elements are also sequences created using the functions `rep ()`, `seq ()` and the operator `:`:

In [6]:
vtr <-  2:7
vtr
vtr <- 7:2
vtr

[1] 2 3 4 5 6 7

[1] 7 6 5 4 3 2

If you need to combine several vectors, use the `c()` function:

In [8]:
x <- 2:3
y <- c(4,6,9)
z <- c(x, y, 10:12, 100)
z

[1]   2   3   4   6   9  10  11  12 100

You can view brief descriptive statistics by vector using the ** `summary()` ** function:

In [11]:
summary(z)

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
   2.00    4.00    9.00   17.44   11.00  100.00

---

### Operations on vectors

The advantage of using vectors over writing each value in a separate variable is the ability to perform 1 operation on all elements of the vector or on several vectors simultaneously, for example, arithmetic operations of addition or multiplication.

In [13]:
v1 <- c(1, 3)
v2 <- c(2, 5)
v1 + v2

[1] 3 8

From the example described above, it can be understood that the addition operation is essentially a superelement sum of vectors when the 1st element of the vector `v1` is added to the 1st element of the vector` v2`(`1 + 2`) and so on. Thus, the resulting vector will have the same length as the vectors `v1` and` v2`.

However, there may be a situation when one of the vectors has a shorter length or even consists of 1 element:

In [15]:
v1 <- c(1, 3)
v2 <- 2
v1 + v2

[1] 3 5

In this case, the number `2` will be added to each element of the vector` v1`. In fact, this means that the vector `v2` will look like `c 2, 2)`, ie there will be a duplication of values to the length of the vector` v1` and then perform the operation of adding elements. Thus, the resulting vector will have the length of the longest of the vectors.

Consider a more complex case where there are vectors with different numbers of elements other than 1:

In [17]:
v1 <- c(2, 3)
v2 <- c(4, 5, 6, 7)
v3 <- c(1, 8, 9)
v1 + v2 + v3

Warning message in v1 + v2 + v3:
"longer object length is not a multiple of shorter object length"

[1]  7 16 17 11

To begin with, it should be noted that the interpreter warns that the lengths of the vectors are not multiples (if they were vectors of length 2, 4, 8, then there would be no warning).

If you extend each vector to the length of the maximum of them, repeating the elements cyclically, you get a set (*marked added elements*):

```r
v1 <- c(2, 3,*2,*3)
v2 <- c(4, 5, 6, 7)
v3 <- c(1, 8, 9,*1)
```

Subtraction (`-`), division(`/`) and multiplication (`*`) operations are performed similarly.

The relation operators and logical operators also act element by element with respect to the vector, but the result is a collection (vector) of values of the logical type `logical` with the values` TRUE/FALSE`.

Consider an example of finding all elements of the array `v1` that are greater than the corresponding index elements of the array` v2`:

In [20]:
v1 <- c(2, 4, 7, 9, 12)
v2 <- c(6, 4, 6, 7, 1)
v1 > v2

[1] FALSE FALSE  TRUE  TRUE  TRUE

In essence, as a result of execution there is a comparison of each element of both vectors among themselves: `2>6`,` 4>4`, `7>6`,` 9>7`, `12>1`.

Therefore, the previously studied operators (arithmetic, logical, relations) can be used to work with vectors as well.

### Naming vector elements

In order to understand what vectors mean and what data is often described, analysts need to sign this data.

We will write down information about daily visits to the site by users during the week in the following way:

In [22]:
# Count of unique bank branch visits from Monday to Sunday
data <- c(1245, 2112, 1321, 1231, 2342, 1718, 1980)

Next, assign values to the days of the week using the `names ()` function:

In [24]:
names(data) <- c("Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")
print(data)

   Monday   Tuesday Wednesday  Thursday    Friday  Saturday    Sunday
     1245      2112      1321      1231      2342      1718      1980

Otherwise, this code could be written as follows:

In [26]:
data <- c(1245, 2112, 1321, 1231, 2342, 1718, 1980)
days <- c("Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")
names(data) <- days
data

   Monday   Tuesday Wednesday  Thursday    Friday  Saturday    Sunday
     1245      2112      1321      1231      2342      1718      1980

If we need to get information, for example, about the name of the 4th element of the vector, we can use the code:

In [28]:
names(data)[4]

[1] "Thursday"

The `names ()` function allows not only to set the values of names for vector elements, but also to obtain information about them.

---

### Access to vector elements

Indexing of elements inside the wind occurs from `1` to` n`, where `n` is the number of elements of the vector.

<div class = "alert alert-info alert-sm"> &nbsp; Note. In `R`, the indexing of array, vector, and all other collection types begins with <b>1</b>, not with <b class ="text-danger" style ="text-decoration: line-through">0</b>.<div>

Consider the previous example:

In [30]:
data <- c(1245, 2112, 1321, 1231, 2342, 1718, 1980)
days <- c("Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")
names(data) <- days

In order to record information only about site visitors on `Wednesday`, you need to use the operator `[]` and specify the index of the element in the array:

In [32]:
data_wednesday <- data[3]
data_wednesday

Wednesday
     1321

If there is a need to get several elements of the vector that are out of order, you can do it like this:

In [34]:
some_days <- data[c(1, 2, 5)]
some_days

 Monday Tuesday  Friday
   1245    2112    2342

From the example above it is clear that the indices of the vector `data` are another vector `c(1, 2, 5)`, so it can be declared as a separate variable:

In [35]:
indexes <- c(1, 2, 5)
some_days <- data[indexes]
some_days

 Monday Tuesday  Friday
   1245    2112    2342

If there is a need to obtain information about several elements that are placed in a row, then for convenience (and in the case when such an array consists, for example, of 1000+ elements) use the operator `:`, for example:

In [37]:
working_days <- data[1:5]
working_days

   Monday   Tuesday Wednesday  Thursday    Friday
     1245      2112      1321      1231      2342

Thus, all working days of the week are selected for the `working_days` vector.

---

### Useful functions

Let's take a look at some useful features that will simplify working with vectors. For further calculations we will use two vectors `A` and` B`:

In [39]:
A <- c(3, 5, 8, 2, 5, 4, 2)
B <- c(3, NA, 1, NA, 6, 4, 5)
A
B

[1] 3 5 8 2 5 4 2

[1]  3 NA  1 NA  6  4  5

<i class = "fa fa-sticky-note-o"> </i> **Function `sum()`**. This function is used to find the sum of the elements of the collection:

In [41]:
sum(A)
sum(B)

[1] 29

[1] NA

An interesting point is that in the presence of gaps in the data (value `NA`) the calculation of the amount is impossible. In this case, the functions can take the additional parameter `na.rm = T`, where` T` is an abbreviation of `TRUE`, which indicates the need to remove gaps in the data before performing the operation.

_Note. You should check the documentation for such a parameter in the function. If it is not present, then it is necessary to carry out cleaning in other ways before work with the data._

In [43]:
sum(B, na.rm = T)

[1] 19

<i class = "fa fa-sticky-note-o"> </i> **The `mean ()`** function is used to find the arithmetic mean of numbers:

In [45]:
mean(A)
mean(B, na.rm = T)

[1] 4.142857

[1] 3.8

<i class = "fa fa-sticky-note-o"> </i> **`min ()` and `max ()`** functions allow you to find the minimum and maximum values, respectively:

In [47]:
min(A)
max(A)

[1] 2

[1] 8

Also to work in `R` there is a large number of built-in implemented functions to perform statistical, econometric and other research in the field of economics and beyond. Try the `sd()`, `cov()`, `cor()` functions.

<i class = "fa fa-sticky-note-o"> </i> **The `length ()`** function helps to determine the "length" of a vector, ie the number of elements:

In [48]:
length(A)
length(B)

[1] 7

[1] 7

<i class = "fa fa-sticky-note-o"> </i> **The `unique ()`** function identifies unique elements in an array:

In [50]:
A
unique(A)

print("---")

B
unique(B)

[1] 3 5 8 2 5 4 2

[1] 3 5 8 2 4

[1] "---"

[1]  3 NA  1 NA  6  4  5

[1]  3 NA  1  6  4  5

<i class = "fa fa-sticky-note-o"> </i> **The `intersect()`** function allows you to find common elements of two vectors, so for vectors `A` and` B` common values are ` 3`, `4` and` 5`:

In [52]:
A
B
intersect(A, B)

[1] 3 5 8 2 5 4 2

[1]  3 NA  1 NA  6  4  5

[1] 3 5 4

Conversely, <i class = "fa fa-sticky-note-o"> </i> **The `union()`** function allows you to combine elements of both sets / vectors:

In [54]:
A
B
union(A, B)

[1] 3 5 8 2 5 4 2

[1]  3 NA  1 NA  6  4  5

[1]  3  5  8  2  4 NA  1  6

Try to understand the operation of the functions `setdiff()`, `setequal()`, `is.element()`.

_I recommend reading the short materials here: https://stat.ethz.ch/R-manual/R-devel/library/base/html/sets.html_.

---

### Correction of data (NA, NaN, Inf)

In the process of working with data there are problems associated with the correctness of their reading, conversion and operations on them. For example, an incorrect entry in the field of integer type `" +10 "` instead of `10` may result in conversion to` NaN` or division by `0` to` Inf`.

Before using numerical and other data, the stage of cleaning and replacement of values is usually performed depending on the tasks of programming / research. In `R` the following types of the missed values are possible:

- [x] `NA` ** - Not Available.
- [x] `NaN` ** - Not a Number.
- [x] `Inf` ** - Infinity (infinity, can be with the sign` + `and` -`).

Let's start with vector:

In [56]:
vtr <- c(1, -2, NA, NaN, Inf, 1223, -Inf, NA, 21) 
vtr

[1]    1   -2   NA  NaN  Inf 1223 -Inf   NA   21

You can check a single value for a space with the functions `is.na()`, `is.nan()`, `is.infinite()`, `is.finite()`.

In [58]:
is.na(vtr)
is.nan(vtr)
is.infinite(vtr)
is.finite(vtr) # if infinite == TRUE => finite == FALSE :)

[1] FALSE FALSE  TRUE  TRUE FALSE FALSE FALSE  TRUE FALSE

[1] FALSE FALSE FALSE  TRUE FALSE FALSE FALSE FALSE FALSE

[1] FALSE FALSE FALSE FALSE  TRUE FALSE  TRUE FALSE FALSE

[1]  TRUE  TRUE FALSE FALSE FALSE  TRUE FALSE FALSE  TRUE

Then replacement of values can be executed as follows (we will replace all `NA` on` 1000`, and `Nan` on` 500`):

In [60]:
vtr[is.nan(vtr)] <- 500
vtr

vtr[is.na(vtr)] <- 1000
vtr

## Nan also replaced with is.na()!!!

[1]    1   -2 1000  500  Inf 1223 -Inf 1000   21

[1]    1   -2 1000  500  Inf 1223 -Inf 1000   21

And then replace `Inf` with the `maximum` value in the vector, and `-Inf` with the `minimum`:

In [62]:
vtr <- c(1, -2, NA, NaN, Inf, 1223, -Inf, NA, 21) 
vtr
vtr[vtr == Inf] <- max(vtr[is.finite(vtr)], na.rm = T)
vtr[vtr == -Inf] <- min(vtr[is.finite(vtr)], na.rm = T)
vtr

[1]    1   -2   NA  NaN  Inf 1223 -Inf   NA   21

[1]    1   -2   NA  NaN 1223 1223   -2   NA   21

If you want to replace the value in `Inf` regardless of the sign, you can use` is.infinite() `.

---

## 2. Matrices

### Creating matrices

**Matrix** - a collection of elements of the same type (`numeric`,` character`, `logical`) with a fixed set of rows and columns. In the case where the matrix has only rows and columns, it is a two-dimensional data array.

The matrix is created using the `matrix()` function:

In [65]:
matrix(1:10, byrow = TRUE, nrow = 2)

     [,1] [,2] [,3] [,4] [,5]
[1,] 1    2    3    4     5
[2,] 6    7    8    9    10

where `1:10` - a set of elements of the matrix, it can also be a pre-formed vector (entered, by calculation, from a file, etc.),`byrow = TRUE` - means that the elements in the matrix will be written in rows, so in the pedestrian line contains the value `1:5`, and the second` 6:10` (if we need to write information on the lines then we should use `byrow = FASLE`),`nrow` - the number of rows of the matrix.

In [67]:
sales1 <- c(12, 14, 15)
sales2 <- c(22, 15, 21)
sales <- c(sales1, sales2)
m <- matrix(sales, byrow= T, nrow = 2)
m

     [,1] [,2] [,3]
[1,] 12   14   15
[2,] 22   15   21

---

### Naming matrices

To specify the names of rows and columns of the matrix, use the functions `rownames()` and `colnames()`:

In [69]:
m <- matrix(1:9, nrow = 3)
rownames(m) <- c("row1", "row2", "row3")
colnames(m) <- c("c1", "c2", "c3")
m

     c1 c2 c3
row1 1  4  7
row2 2  5  8
row3 3  6  9

---

### Add rows and columns

Special methods `cbind/rbind` are used to change the number of elements in rows and columns of matrices, as well as to quickly combine them.

<i class = "fa fa-sticky-note-o"></i> ** The `cbind` ** function allows you to add one or more matrices and/or vectors behind one of the columns. That is, there is not a simple connection, but a comparison by key field. Consider an example:

In [74]:
m1 <- matrix(c(1:3, 101:103), nrow = 3)
colnames(m1) <- c("A", "B")

m2 <- matrix(c(201:203, 1001:1003), nrow = 3)
colnames(m2) <- c("C", "D")

m_bind <- cbind(m1, m2)

m1
m2
m_bind

     A B
[1,] 1 101
[2,] 2 102
[3,] 3 103

     C   D
[1,] 201 1001
[2,] 202 1002
[3,] 203 1003

     A B   C   D
[1,] 1 101 201 1001
[2,] 2 102 202 1002
[3,] 3 103 203 1003

---

### Access to matrix elements

The elements of the matrix are accessed by the index of rows and columns. You can select ranges in a similar way to vectors.

Let's look at an example:

In [76]:
m <- matrix(11:25, nrow = 3)
m

     [,1] [,2] [,3] [,4] [,5]
[1,] 11   14   17   20   23
[2,] 12   15   18   21   24
[3,] 13   16   19   22   25

To display the 10th element of the matrix, you can use the entries _(note that the account is from the right left corner of the columns)_:

In [78]:
m[10]    
m[[10]]

[1] 20

[1] 20

To display the same element using row and column indexes, write as follows:

In [80]:
# Row #1
# Column #4
m[1,4]

[1] 20

**Question**: What record should you use ti get **18**?

**Answer**: `m[2,3]`

In [84]:
m[2,3]

[1] 18

If you want to output / use an entire row or a whole column, then the block with the index of unnecessary dimensionality can be left blank:

In [86]:
m[1, ] # first row only
m[c(1,3), ] # first and third row only

[1] 11 14 17 20 23

     [,1] [,2] [,3] [,4] [,5]
[1,] 11   14   17   20   23
[2,] 13   16   19   22   25

In [88]:
m[, 1] # first column only
m[, c(1,3)] # first and third column only

[1] 11 12 13

     [,1] [,2]
[1,] 11   17
[2,] 12   18
[3,] 13   19

You can also specify a list of rows and columns to be output / received simultaneously:

In [90]:
m[c(1,3), 2:4]

     [,1] [,2] [,3]
[1,] 14   17   20
[2,] 16   19   22

You can exclude individual columns or rows by using indexes with minus signs (`-`):

In [92]:
m[-1, c(-2:-3)]

     [,1] [,2] [,3]
[1,] 12   21   24
[2,] 13   22   25

---

### Useful functions

#### Matrix dimmentions

To obtain information about the dimensions of the table, there are special functions: `nrow()`, `ncol()`, `dim()`:

In [13]:
# Decalre matrix
m <- matrix(1:15, ncol = 3)
m

print(paste0("Rows: ", nrow(m)))
print(paste0("Cols: ", ncol(m)))

print(paste("Dim: ", paste0(dim(m), collapse = " x ")))

     [,1] [,2] [,3]
[1,] 1     6   11
[2,] 2     7   12
[3,] 3     8   13
[4,] 4     9   14
[5,] 5    10   15

[1] "Rows: 5"
[1] "Cols: 3"
[1] "Dim:  5 x 3"

Using `nrow()` and` ncol()` allows you to access the last row and column of the matrix, respectively:

In [14]:
m[nrow(m), ] # last row
m[, ncol(m)] # last colum

[1]  5 10 15

[1] 11 12 13 14 15

---

# 3. Factors

Factors in `R` programming allow you to represent a vector of values as categorical values, rather than just a set of text data or numbers. The advantage of the categorical data type is that the element can take only a limited number of values, and not any value that allows the data type.

For example, a numeric vector may contain an infinitely large variation of the values `c(1, 0.021, 192.1444, ..., etc.)`, the character sets may also be different `c ("sdf & Tg6","sdf * Y & 65")`. The number of combinations of such vectors is very large.

In the case of categories, we are talking about certain fixed values. A good example is forms that are filled out on sites with drop-down lists, where the user cannot enter a value, but only select from an existing list. So in the gender field there is usually a limited set of possible options: `Male`,` Female`, `Other`. The user can select only one of these values and does not have the ability to enter something else _(this is an example, each resource can make different forms for users)_.

Creation of factors in `R` occurs by means of function **`factor()`**:

In [3]:
sex <- c("Male", "Female", "Other", "Male", "Female", "Male", "Female", "Female")
sex_factor <- factor(sex)
sex_factor

[1] Male   Female Other  Male   Female Male   Female Female
Levels: Female Male Other

When creating a factor, each unique element gets its own ** _ digital? _ ** _ (from the outside it looks like this, it needs to be clarified) _ value inside the collection, this value is called the level (`level`). In the previous example, the variable `sex_factor` received the levels `Female`, `Male`, `Other` in alphabetical order. If we convert factors to numbers, we get:

In [5]:
as.numeric(sex_factor)

[1] 2 1 3 2 1 2 1 1

Thus it is clear that `Female` = 1, `Male` = 2, `Other` = 3. Consider a situation where we get data in which the order of values in the factor collection is different, for example, we need to specify so that `Male` = 1, `Female` = 2, `Other` = 3:

In [7]:
sex <- c("Male", "Female", "Other", "Male", "Female", "Male", "Female", "Female")
sex_factor <- factor(sex, levels = c("Male", "Female", "Other"))
sex_factor
levels(sex_factor) # read levels of factor
as.numeric(sex_factor)

[1] Male   Female Other  Male   Female Male   Female Female
Levels: Male Female Other

[1] "Male"   "Female" "Other"

[1] 1 2 3 1 2 1 2 2

Now the order of the levels corresponds to ours and this will allow us to successfully combine our collection with similar ones that have the same set of values.

Sometimes it is necessary to change not only the order of the elements in the factorial collection, but also their names. Let's consider a situation when we need to rename values `Male`,` Female`, `Other` in` M`, `F`,` O`:

In [9]:
sex <- c("Male", "Female", "Other", "Male", "Female", "Male", "Female", "Female")
sex_factor <- factor(sex, levels = c("Male", "Female", "Other"))
levels(sex_factor) <- c("M", "F", "O")
sex_factor

[1] M F O M F M F F
Levels: M F O

But you should check you type with `is.factor()` before converting to numbers:

In [15]:
cities <- c("Rivne", "Ostroh", "Zdolbuniv", "Dubno", "Sarny")
cities_as_factors <- factor(cities)
as.numeric(cities_as_factors)
as.numeric(cities) # you cannot convert characters vector to numerics

[1] 3 2 5 1 4

Warning message in eval(expr, envir, enclos):
"NAs introduced by coercion"

[1] NA NA NA NA NA

---

# 4. Dataframes

Data frames are the most popular data structure in R, becouse it allows collect data with different columns type in one object and quickly manipulate it.

A `data frame`, a matrix-like structure whose columns may be of differing types (numeric, logical, factor and character and so on).

The function `data.frame()` creates data frames, tightly coupled collections of variables which share many of the properties of matrices and of lists, used as the fundamental data structure by most of R's modeling software.

**Syntax**

```{r}
data.frame(..., row.names = NULL, check.rows = FALSE,
           check.names = TRUE, fix.empty.names = TRUE,
           stringsAsFactors = FALSE)
```

**Arguments** (top useful)

- [x] `...` - these arguments are of either the form value or tag = value. Component names are created based on the tag (if present) or the deparsed argument itself.
- [x] `row.names` - NULL or a single integer or character string specifying a column to be used as row names, or a character or integer vector giving the row names for the data frame.
- [x] `stringsAsFactors` - logical: should character vectors be converted to factors? The factory-fresh default has been TRUE previously but has been changed to FALSE

**Details**

A `data frame` is a list of variables of the same number of rows with unique row names, given class `data.frame`. If no variables are included, the row names determine the number of rows.

`data.frame` converts each of its arguments to a data frame by calling as.data.frame(optional = TRUE). As that is a generic function, methods can be written to change the behaviour of arguments according to their classes: R comes with many such methods. Character variables passed to `data.frame` are converted to `factor` columns unless protected argument `stringsAsFactors` is false. If a list or data frame or matrix is passed to `data.frame` it is as if each component or column had been passed as a separate argument.

---

### Creating Data Frames

Data frames are usually created by reading in a dataset from file, scraping from websites. However, data frames can also be created explicitly with the `data.frame()` function or they can be coerced from other types of objects like lists. In this case Ill create a simple data frame df and assess its basic structure:

In [17]:
df <- data.frame(int_col = 1:5,
                char_col = c("a", "b", "c", "d", "e"),
                log_col = c(T,T,T,F,T),
                double_col = c(2.1, 1, 0.5, pi, 12.7))
df

  int_col char_col log_col double_col
1 1       a         TRUE    2.100000
2 2       b         TRUE    1.000000
3 3       c         TRUE    0.500000
4 4       d        FALSE    3.141593
5 5       e         TRUE   12.700000

In [19]:
# assess the structure of a data frame
str(df)

'data.frame':	5 obs. of  4 variables:
 $ int_col   : int  1 2 3 4 5
 $ char_col  : chr  "a" "b" "c" "d" ...
 $ log_col   : logi  TRUE TRUE TRUE FALSE TRUE
 $ double_col: num  2.1 1 0.5 3.14 12.7

In [21]:
# number of rows
nrow(df)

[1] 5

In [23]:
# number of columns
ncol(df)

[1] 4

If you want convert "on fly" character columns to factor use `stringsAsFactors = TRUE`:

In [28]:
df <- data.frame(int_col = 1:5,
                char_col = c("a", "b", "c", "d", "e"),
                log_col = c(T,T,T,F,T),
                double_col = c(2.1, 1, 0.5, pi, 12.7),
                stringsAsFactors = TRUE) # warning it depends on local settings of R
df

  int_col char_col log_col double_col
1 1       a         TRUE    2.100000
2 2       b         TRUE    1.000000
3 3       c         TRUE    0.500000
4 4       d        FALSE    3.141593
5 5       e         TRUE   12.700000

One more way to create data frame is combining it from vectors:

In [33]:
v_int <- 1:5
v_char = c("a", "b", "c", "d", "e")
v_log = c(T,T,T,F,T)
v_double = c(2.1, 1, 0.5, pi, 12.7)

df <- data.frame(int_col = v_int,
                char_col = v_char,
                log_col = v_log,
                double_col = v_double,
                stringsAsFactors = TRUE) # warning it depends on local settings of R
df

  int_col char_col log_col double_col
1 1       a         TRUE    2.100000
2 2       b         TRUE    1.000000
3 3       c         TRUE    0.500000
4 4       d        FALSE    3.141593
5 5       e         TRUE   12.700000

Creating data.frames from lists (P.S. lists explained in next chapter):

In [35]:
demo_list <- list(int_col = v_int,
                  char_col = v_char,
                  log_col = v_log,
                  double_col = v_double)
as.data.frame(demo_list)

  int_col char_col log_col double_col
1 1       a         TRUE    2.100000
2 2       b         TRUE    1.000000
3 3       c         TRUE    0.500000
4 4       d        FALSE    3.141593
5 5       e         TRUE   12.700000

Matrix can be base for data frame too:

In [38]:
demo_matrix <- matrix(100:119, nrow = 5, ncol = 4)
demo_matrix

as.data.frame(demo_matrix)

     [,1] [,2] [,3] [,4]
[1,] 100  105  110  115
[2,] 101  106  111  116
[3,] 102  107  112  117
[4,] 103  108  113  118
[5,] 104  109  114  119

  V1  V2  V3  V4
1 100 105 110 115
2 101 106 111 116
3 102 107 112 117
4 103 108 113 118
5 104 109 114 119

---

## Extending data frames

You can add rows and columns to data frame. Merging two data frames by selected column values awailable too.

`cbind()` adds new column

In [53]:
letters_frame <-  data.frame(A1 = c("A", "B", "C"),
                            A2 = c("D", "E", "F"))
letters_frame

A3 = c(1, 2, 3)
cbind(letters_frame, A3)

  A1 A2
1 A  D
2 B  E
3 C  F

  A1 A2 A3
1 A  D  1
2 B  E  2
3 C  F  3

`rbind()` adds new row

In [57]:
letters_frame <-  data.frame(A1 = c("A", "B", "C"),
                            A2 = 1:3)
letters_frame

next_row = c("D", 4) # data types by row should be the same as in initial data frame
rbind(letters_frame, next_row)

  A1 A2
1 A  1
2 B  2
3 C  3

  A1 A2
1 A  1
2 B  2
3 C  3
4 D  4

If you have two data frames with the same key, but it ordered in different way and you cannot use `cbind()` try `merge()`:

In [62]:
df1 <- data.frame(Id = c(1:3),
                  Name = c("Nick", "Jake", "Jane"))
df1

df2 <- data.frame(Id = c(2, 1, 3), # defferent order from Id in df1
                  Age = c(34, 21, 45))
df2

df_final <- merge(df1, df2, by = "Id")
df_final

  Id Name
1 1  Nick
2 2  Jake
3 3  Jane

  Id Age
1 2  34
2 1  21
3 3  45

  Id Name Age
1 1  Nick 21
2 2  Jake 34
3 3  Jane 45

---

## Subsetting Data Frames

Data frames possess the characteristics of both lists and matrices: if you subset with a single vector, they behave like lists and will return the selected columns with all rows; if you subset with two vectors, they behave like matrices and can be subset by row and column:

In [69]:
df <- data.frame(int_col = 1:5,
                char_col = c("a", "b", "c", "d", "e"),
                log_col = c(T,T,T,F,T),
                double_col = c(2.1, 1, 0.5, pi, 12.7),
                row.names = paste0("row_", 1:5), # setting row names 
                stringsAsFactors = TRUE) # warning it depends on local settings of R
df

      int_col char_col log_col double_col
row_1 1       a         TRUE    2.100000
row_2 2       b         TRUE    1.000000
row_3 3       c         TRUE    0.500000
row_4 4       d        FALSE    3.141593
row_5 5       e         TRUE   12.700000

In [73]:
# subsetting by row numbers
df[3:4, ] # missing in columns dimmension means ALL

      int_col char_col log_col double_col
row_3 3       c         TRUE   0.500000
row_4 4       d        FALSE   3.141593

In [74]:
# subsetting by row numbers with minus - removing rows
df[-c(3:4), ]

      int_col char_col log_col double_col
row_1 1       a        TRUE     2.1
row_2 2       b        TRUE     1.0
row_5 5       e        TRUE    12.7

In [75]:
# subsetting by row names
df[c("row_4", "row_5"), ]

      int_col char_col log_col double_col
row_4 4       d        FALSE    3.141593
row_5 5       e         TRUE   12.700000

In [78]:
# subsetting columns like a list
df[c("log_col", "double_col")]

      log_col double_col
row_1  TRUE    2.100000
row_2  TRUE    1.000000
row_3  TRUE    0.500000
row_4 FALSE    3.141593
row_5  TRUE   12.700000

In [81]:
# subset for both rows and columns
df[2:5, c(1, 3:4)]

      int_col log_col double_col
row_2 2        TRUE    1.000000
row_3 3        TRUE    0.500000
row_4 4       FALSE    3.141593
row_5 5        TRUE   12.700000

In [84]:
# use a vector to subset
vctr <- c(1, 3:4)
df[ , vctr]

      int_col log_col double_col
row_1 1        TRUE    2.100000
row_2 2        TRUE    1.000000
row_3 3        TRUE    0.500000
row_4 4       FALSE    3.141593
row_5 5        TRUE   12.700000

**You can also subset data frames based on conditional statements**

In [88]:
# select only with log_col == TRUE
df[df$log_col == TRUE,]

      int_col char_col log_col double_col
row_1 1       a        TRUE     2.1
row_2 2       b        TRUE     1.0
row_3 3       c        TRUE     0.5
row_5 5       e        TRUE    12.7

In [91]:
# select only with double_col > 1
df[df$double_col > 1, ]

      int_col char_col log_col double_col
row_1 1       a         TRUE    2.100000
row_4 4       d        FALSE    3.141593
row_5 5       e         TRUE   12.700000

In [94]:
# select only with char_col == 'a', 'e'
df[df$char_col %in% c("a", "e"), ] # %in% operator for check multuiple values

      int_col char_col log_col double_col
row_1 1       a        TRUE     2.1
row_5 5       e        TRUE    12.7

In [96]:
# select only with double_col > 1 and log_col == TRUE
df[df$log_col == TRUE & df$double_col > 1, ]

      int_col char_col log_col double_col
row_1 1       a        TRUE     2.1
row_5 5       e        TRUE    12.7

In [99]:
# select only specific columns with double_col > 1 and log_col == TRUE
df[df$log_col == TRUE & df$double_col > 1, c("log_col", "int_col", "double_col")]

      log_col int_col double_col
row_1 TRUE    1        2.1
row_5 TRUE    5       12.7

---

### Order data.frame

Let's use our previous sample `data.frame` but with unordered values:

In [106]:
df <- data.frame(int_col = c(1, 5, 3, 4, 2),
                char_col = c("b", "a", "a", "d", "e"),
                log_col = c(T,T,T,F,T),
                double_col = c(2.1, 1, 0.5, pi, 12.7),
                row.names = paste0("row_", 1:5), # setting row names 
                stringsAsFactors = TRUE) # warning it depends on local settings of R
df

      int_col char_col log_col double_col
row_1 1       b         TRUE    2.100000
row_2 5       a         TRUE    1.000000
row_3 3       a         TRUE    0.500000
row_4 4       d        FALSE    3.141593
row_5 2       e         TRUE   12.700000

You can use `order()` function for sorting `data.frames`.

In [108]:
# sort by int_col
df[order(df$int_col),]

      int_col char_col log_col double_col
row_1 1       b         TRUE    2.100000
row_5 2       e         TRUE   12.700000
row_3 3       a         TRUE    0.500000
row_4 4       d        FALSE    3.141593
row_2 5       a         TRUE    1.000000

Use `-` minus to sort descending

In [111]:
# sort by double_col
df[order(-df$double_col),]

      int_col char_col log_col double_col
row_5 2       e         TRUE   12.700000
row_4 4       d        FALSE    3.141593
row_1 1       b         TRUE    2.100000
row_2 5       a         TRUE    1.000000
row_3 3       a         TRUE    0.500000

You can also sor by multiple columns with `order(column1, column2)` or `order(column1, -column2)`.

### Manipulating `data.frames`


typeconvert
ifelse
createnew columns (calculate age) ?lubridate
missing remove
missing replace

edit with dataeditR

---

## TASK 1 on data.frames

1. Install package and load package `ISLR`
2. Save dataset `Credit` into variable `credit_data`.
3. Check dataset structure with `str()` function.
4. Convert Student status "yes/no" to 1/0
5. Order dataset by `Rating` descending
6. Filter only `Age > 50` with `Rating > 400`, how many records do you get?
7. Evaluate average `Income` for `Married = YES` `Married = NO` with Age in range [20,30]

    7.1 Make the same for Age [30;40]
    Any conclusion?

## Solution

In [112]:
# 1. install.package ISLR
#install.packages("ISLR")
library(ISLR)

In [119]:
# 2. Save dataset `Credit` into variable `credit_data`.
credit_data <- ISLR::Credit
head(credit_data)

  ID Income  Limit Rating Cards Age Education Gender Student Married Ethnicity
1 1   14.891 3606  283    2     34  11         Male  No      Yes     Caucasian
2 2  106.025 6645  483    3     82  15        Female Yes     Yes     Asian
3 3  104.593 7075  514    4     71  11         Male  No      No      Asian
4 4  148.924 9504  681    3     36  11        Female No      No      Asian
5 5   55.882 4897  357    2     68  16         Male  No      Yes     Caucasian
6 6   80.180 8047  569    4     77  10         Male  No      No      Caucasian
  Balance
1  333
2  903
3  580
4  964
5  331
6 1151

In [120]:
# 3. Check dataset structure with `str()` function.
str(credit_data)

'data.frame':	400 obs. of  12 variables:
 $ ID       : int  1 2 3 4 5 6 7 8 9 10 ...
 $ Income   : num  14.9 106 104.6 148.9 55.9 ...
 $ Limit    : int  3606 6645 7075 9504 4897 8047 3388 7114 3300 6819 ...
 $ Rating   : int  283 483 514 681 357 569 259 512 266 491 ...
 $ Cards    : int  2 3 4 3 2 4 2 2 5 3 ...
 $ Age      : int  34 82 71 36 68 77 37 87 66 41 ...
 $ Education: int  11 15 11 11 16 10 12 9 13 19 ...
 $ Gender   : Factor w/ 2 levels " Male","Female": 1 2 1 2 1 1 2 1 2 2 ...
 $ Student  : Factor w/ 2 levels "No","Yes": 1 2 1 1 1 1 1 1 1 2 ...
 $ Married  : Factor w/ 2 levels "No","Yes": 2 2 1 1 2 1 1 1 1 2 ...
 $ Ethnicity: Factor w/ 3 levels "African American",..: 3 2 2 2 3 3 1 2 3 1 ...
 $ Balance  : int  333 903 580 964 331 1151 203 872 279 1350 ...

In [122]:
# Convert Student status "yes/no" to 1/0
credit_data$Student <- as.character(credit_data$Student) # convert to character first / factors
credit_data$Student <- ifelse(credit_data$Student == "Yes", 1, 0)
head(credit_data)

  ID Income  Limit Rating Cards Age Education Gender Student Married Ethnicity
1 1   14.891 3606  283    2     34  11         Male  0       Yes     Caucasian
2 2  106.025 6645  483    3     82  15        Female 0       Yes     Asian
3 3  104.593 7075  514    4     71  11         Male  0       No      Asian
4 4  148.924 9504  681    3     36  11        Female 0       No      Asian
5 5   55.882 4897  357    2     68  16         Male  0       Yes     Caucasian
6 6   80.180 8047  569    4     77  10         Male  0       No      Caucasian
  Balance
1  333
2  903
3  580
4  964
5  331
6 1151

In [125]:
# 5. Order dataset by `Rating` descending
credit_data <- credit_data[order(-credit_data$Rating),]
head(credit_data)

    ID  Income  Limit Rating Cards Age Education Gender Student Married
324 324 182.728 13913 982    4     98  17         Male  0       Yes
29   29 186.634 13414 949    2     41  14        Female 0       Yes
356 356 180.682 11966 832    2     58   8        Female 0       Yes
86   86 152.298 12066 828    4     41  12        Female 0       Yes
294 294 140.672 11200 817    7     46   9         Male  0       Yes
185 185 158.889 11589 805    1     62  17        Female 0       Yes
    Ethnicity        Balance
324 Caucasian        1999
29  African American 1809
356 African American 1405
86  Asian            1779
294 African American 1677
185 Caucasian        1448

In [135]:
# 6. Filter only `Age > 50` with `Rating > 400`
credict_data_filtered <- credit_data[credit_data$Age > 50 & credit_data$Rating > 400, ]
head(credict_data_filtered)
nrow(credict_data_filtered)

    ID  Income  Limit Rating Cards Age Education Gender Student Married
324 324 182.728 13913 982    4     98  17         Male  0       Yes
356 356 180.682 11966 832    2     58   8        Female 0       Yes
185 185 158.889 11589 805    1     62  17        Female 0       Yes
348 348 160.231 10748 754    2     69  17         Male  0       No
175 175 121.834 10673 750    3     54  16         Male  0       No
391 391 135.118 10578 747    3     81  15        Female 0       Yes
    Ethnicity        Balance
324 Caucasian        1999
356 African American 1405
185 Caucasian        1448
348 Caucasian        1192
175 African American 1573
391 Asian            1393

[1] 73

In [159]:
#7. Evaluate average `Income` for `Married = YES` `Married = NO` with age in rage [20,30]
# 7.1 Make the same for Age [30;40]
credit_data$Gender <- as.character(credit_data$Gender)
marries_yes <- credit_data[credit_data$Age %in% c(20:30) & credit_data$Married == "Yes", ]
head(marries_yes)

    ID  Income Limit Rating Cards Age Education Gender Student Married
11   11 63.095 8117  589    4     30  14         Male  0       Yes
114 114 69.251 6386  474    4     30  12        Female 0       Yes
45   45 31.861 6375  469    3     25  16        Female 0       Yes
19   19 49.570 6384  448    1     28   9        Female 0       Yes
44   44 36.929 6257  445    1     24  14        Female 0       Yes
151 151 63.931 5728  435    3     28  14        Female 0       Yes
    Ethnicity        Balance
11  Caucasian        1407
114 Asian             768
45  Caucasian        1120
19  Asian             891
44  Asian             976
151 African American  581

In [151]:
marries_no <- credit_data[credit_data$Age %in% c(20:30) & credit_data$Married == "No", ]
head(marries_no)

    ID  Income Limit Rating Cards Age Education Gender Student Married
212 212 29.567 5309  397    3     25  15         Male  0       No
94   94 16.479 5435  388    2     26  16         Male  0       No
272 272 44.978 4866  347    1     30  10        Female 0       No
206 206 10.793 3878  321    8     29  13         Male  0       No
179 179 28.316 4391  316    2     29  10        Female 0       No
186 186 30.420 4442  316    1     30  14        Female 0       No
    Ethnicity        Balance
212 Caucasian        799
94  African American 937
272 Caucasian        436
206 Caucasian        638
179 Caucasian        453
186 African American 450

In [155]:
mean(marries_yes$Income) # is it better to be merried? :)
mean(marries_no$Income)

[1] 35.25635

[1] 25.16183

In [208]:
marries_yes <- credit_data[credit_data$Age %in% c(30:40) & credit_data$Married == "Yes", ]
marries_no <- credit_data[credit_data$Age %in% c(30:40) & credit_data$Married == "No", ]
mean(marries_yes$Income) # is it better to be merried? :)
mean(marries_no$Income)

[1] 38.40847

[1] 43.06046

---

### TASK 2 on data.frame

1. Find columns with missing values
Remove records with missing in field/column X
2. Replace missing values in columns

### SOLUTION

---

# 5. Lists

Lists are the R objects which contain elements of different types like  numbers, strings, vectors and another list inside it. A list can also contain a matrix or a function as its elements. List is created using `list()` function.

Before start lest see one more package for working with date `lubridate`. It has a lot of functions for date parsing, manipulating and other. Check it with:

In [163]:
#install.package("lubridate")
#??lubridate

Attaching package: 'lubridate'


The following objects are masked from 'package:base':

    date, intersect, setdiff, union

For our sample we need function `ymd()` that parse charater date from format like "2012-10-25".

In [166]:
library(lubridate)
date1 <- ymd("2021-05-25")
date2 <- ymd("2021-05-27")

date1
date2

[1] "2021-05-25"

[1] "2021-05-27"

You can also use `ymdhms()` to parse date and time correctly.

In [170]:
datetime <- ymd_hms("2021-05-25 11:05:12", tz = "UTC") # wee need this for client transactions fix
datetime

[1] "2021-05-25 11:05:12 UTC"

### Creating a List

Following is an example to create a list containing vectors, strings, numbers and a logical values. Our list will describe a model of banks client:

In [189]:
# initial values

set.seed(1) # for fixing pseudo-random

client_name <- "John Doe"
services <- c("credit", "deposite", "online-app")
is_active <- TRUE
transactions <- data.frame(contract_id = sample(10000:99999, size = 2, replace = T),# random numbers
                          datetime = c(ymd_hms("2021-05-25 11:05:12"),
                                      ymd_hms("2021-05-25 11:07:14"),
                                      ymd_hms("2021-05-25 11:08:02"),
                                      ymd_hms("2021-05-25 11:12:45"),
                                      ymd_hms("2021-05-25 11:47:00"),
                                      ymd_hms("2021-05-25 11:48:08")),
                         oper_type = sample(0:1, size=6, replace = T), # 1 for debet, 0 for credet
                         amount = round(sample(1:1000, size = 6) + runif(6),2))   

#change AMOUNT to minus for debet (opertype == 1 
transactions$amount <- ifelse(transactions$oper_type == 1, (-1)*transactions$amount, transactions$amount) 
transactions

  contract_id datetime            oper_type amount
1 34387       2021-05-25 11:05:12 1         -187.72
2 69520       2021-05-25 11:07:14 0          307.99
3 34387       2021-05-25 11:08:02 0          993.38
4 69520       2021-05-25 11:12:45 0          597.78
5 34387       2021-05-25 11:47:00 1         -277.93
6 69520       2021-05-25 11:48:08 1         -874.21

In [192]:
# creating list of signle objects, vector and dataframe
list_data <- list(client_name, is_active, services, transactions)
list_data

[[1]]
[1] "John Doe"

[[2]]
[1] TRUE

[[3]]
[1] "credit"     "deposite"   "online-app"

[[4]]
  contract_id            datetime oper_type  amount
1       34387 2021-05-25 11:05:12         1 -187.72
2       69520 2021-05-25 11:07:14         0  307.99
3       34387 2021-05-25 11:08:02         0  993.38
4       69520 2021-05-25 11:12:45         0  597.78
5       34387 2021-05-25 11:47:00         1 -277.93
6       69520 2021-05-25 11:48:08         1 -874.21

### Naming List Elements

Its better to name elements in list:

In [202]:
names(list_data) <- c("ClientName", "IsActive", "Services", "Transactions")
list_data

$ClientName
[1] "John Doe"

$IsActive
[1] TRUE

$Services
[1] "credit"     "deposite"   "online-app"

$Transactions
  contract_id            datetime oper_type  amount
1       34387 2021-05-25 11:05:12         1 -187.72
2       69520 2021-05-25 11:07:14         0  307.99
3       34387 2021-05-25 11:08:02         0  993.38
4       69520 2021-05-25 11:12:45         0  597.78
5       34387 2021-05-25 11:47:00         1 -277.93
6       69520 2021-05-25 11:48:08         1 -874.21

You can extend list "on fly" with `$`:

In [205]:
list_data$ClientId <- 11125489656
list_data

$ClientName
[1] "John Doe"

$IsActive
[1] TRUE

$Services
[1] "credit"     "deposite"   "online-app"

$Transactions
  contract_id            datetime oper_type  amount
1       34387 2021-05-25 11:05:12         1 -187.72
2       69520 2021-05-25 11:07:14         0  307.99
3       34387 2021-05-25 11:08:02         0  993.38
4       69520 2021-05-25 11:12:45         0  597.78
5       34387 2021-05-25 11:47:00         1 -277.93
6       69520 2021-05-25 11:48:08         1 -874.21

$ClientId
[1] 11125489656

---

### Accessing List Elements

For now every element can be viewed with index in `[[]]` or `[]`:

In [196]:
# access to list element
list_data[1]
typeof(list_data[1])

[[1]]
[1] "John Doe"

[1] "list"

In [199]:
# access to object
list_data[[1]]
typeof(list_data[[1]])

[1] "John Doe"

[1] "character"

Access by `$` also anbled:

In [207]:
list_data$Transactions

  contract_id datetime            oper_type amount
1 34387       2021-05-25 11:05:12 1         -187.72
2 69520       2021-05-25 11:07:14 0          307.99
3 34387       2021-05-25 11:08:02 0          993.38
4 69520       2021-05-25 11:12:45 0          597.78
5 34387       2021-05-25 11:47:00 1         -277.93
6 69520       2021-05-25 11:48:08 1         -874.21

### Manipulating List Elements

---

## TASKS

---

# References

1. The Comprehensive R Archive NetworkRcran: Url: https://cran.r-project.org/
2. RStudio official website. Url: https://rstudio.com/
3. Anaconda official website. Url: https://www.anaconda.com/
4. Introduction to R. Datacamp interactive course. Url:  https://www.datacamp.com/courses/free-introduction-to-r
5. Quanargo. Introduction to R. Url: https://www.quantargo.com/courses/course-r-introduction
6. R Coder Project. Begin your data science career with R language! Url: https://r-coder.com/
7. R Core Team (2019). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria.URL https://www.R-project.org/.
8. A.B. Shipunov, EM Baldin, P.A. Volkova, VG Sufiyanov. Visual statistics. We use R! - M .: DMK Press, 2012. - 298 p .: ill.
9. An Introduction to R. URL: https://cran.r-project.org/doc/manuals/r-release/R-intro.html
10. R programming. https://www.datamentor.io/r-programming
11. Learn R. R Functions. https://www.w3schools.com/r/r_functions.asp
12. UC Business Analytics R Programming Guide. Managing Data Frames. http://uc-r.github.io/dataframes
13. Learn R programming. R - Lists. https://www.tutorialspoint.com/r/r_lists.htm